# Задача 1. Сумма
n=int(input("Введите число n: "))
suma=0
i=2
while i<=n:
    suma=suma+i
    i=i+2

print("Сумма:", suma)