# Задача 17. Сумма на счету
suma=1000
luna=1
while luna<=6:
    suma=suma+suma*0.02
    luna=luna+1

print("Сумма после шести месяцев:", suma)