# Задача 3. Предыдущие и последующие числа
x=int(input("Назовите любое целое число: "))
z=x-2
y=x-1
a=x+1
b=x+2
print("Последовательность чисел следующая:", z, ",", y, ",", x, ",", a, ",", b)