# Задача 7. Сумма процентов за три месяца
S=int(input("Введите сумму сэкономленных Александрой леев: "))
P=int(input("Введите годовой процент: "))
x=(S*P)/400
print("Сумма процентов за три месяца составляет:", x, "леев")