# Задача 10. Оценка
nota=int(input("Введите оценку (1-10): "))
match nota:
    case 1|2|3|4:
        print("Неудовлетворительно")
    case 5|6:
        print("Удовлетворительно")
    case 7|8:
        print("Хорошо")
    case 9|10:
        print("Очень хорошо")
    case _:
        print("Неизвестная оценка")