# Задача 15. Предыдущее число
a=int(input("Введите а: "))
b=int(input("Введите b: "))

if a+1==b:
    print("Число a предшествует числу b")
else:
    print("Число a не предшествует числу b")