# Задача 9. Функция
x=float(input("Введите x: "))

if x<-3:
    f=x**2+1
elif -3<=x<=3:
    f=x-2
else:
    f=2*x**2-5*x+1
print("Значение х по функции:", f)